DataProcessors/ПослатьПисьмаПоДокументамКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПослатьПисьмаПоДокументамКОтправке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОчищать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПисьмоОДолгах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПисьмоОДолгах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВремяОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДокументыКОтправкеПоЭП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыКОтправкеПоЭП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПопытокЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭлАдрес</Name>
					<Comment>Адрес эл. почты для отправки письма с долгами</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидВложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов</Name>
			<Comment>(Общ) Оперативное ведение расчетов с контрагентами по договорам с учетом расчетов по документам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета для договоров в у.е. </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетовСКонтрагентом</Name>
					<Comment>Незакрытый документ поставки/оплаты</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетовСКонтрагентом</Name>
					<Comment>Вид расчетов (по приобретению, по реализации, прочее)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетовСКонтрагентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УпрУчет</Name>
					<Comment>Отражается ли документ расчетов с контрагентами в управленческом учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НазваниеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазваниеБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Альметьевск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Владимир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Киров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Липецк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Молодогвардейская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НабережныеЧелны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НижнийНовгород</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятигорск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рязань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Саранск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Север</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тамбов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тверь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ульяновск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чебоксары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шахты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярославль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидВложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидВложения</Name>
			<Comment>Для определения вложения в электронное письмо</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Долги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПоТоварамБезЦен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>(Общ) Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПослатьПисьмаПоДокументамКОтправке/Ext/ObjectModule.bsl
Перем ЗапросДоговоровКонтрагента;

Процедура ОтправкаПисем() Экспорт 
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если  Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	
	Почта = Новый ИнтернетПочта; 
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Возврат; 
	КонецПопытки;
	
	
	МакетДолгов = ПолучитьМакет("ПисьмоОДолгах");
	ТабДок = Новый ТабличныйДокумент;
	
	Если Константы.База.Получить()= Перечисления.НазваниеБазы.Воронеж Тогда 
		НазваниеОрганизации = "Реестр предстоящих И ПРОСРОЧЕННЫХ платежей фирме ООО ""Москворечье Воронеж""";
	Иначе		
		НазваниеОрганизации = "Реестр предстоящих И ПРОСРОЧЕННЫХ платежей фирме ООО ""Москворечье-Трейдинг"" (" + Константы.База.Получить() + ")";
	КонецЕсли;		
	
	Если Константы.ИспользоватьДанныеБиллингаДляПисемОДолгах.Получить() Тогда
		
		ЗапросКонтрагентов = Новый Запрос;
		ЗапросКонтрагентов.Текст =
		"ВЫБРАТЬ
		|	ПисьмоОДолгах.ДоговорКонтрагента.Владелец КАК Контрагент
		|ПОМЕСТИТЬ ВТ_КонтрагентыКоторымУжеОтправленыПисьма
		|ИЗ
		|	РегистрСведений.ПисьмоОДолгах КАК ПисьмоОДолгах
		|ГДЕ
		|	ПисьмоОДолгах.Количество > 0
		|	И ПисьмоОДолгах.Период МЕЖДУ &Период1 И &Период2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДокументыКОтправкеПоЭП.Объект КАК Справочник.Контрагенты) КАК Контрагенты,
		|	ДокументыКОтправкеПоЭП.ЭлАдрес КАК ЭлАдрес,
		|	ВТ_КонтрагентыКоторымУжеОтправленыПисьма.Контрагент КАК КонтрагентОтправлен
		|ПОМЕСТИТЬ ВТ_Контрагенты
		|ИЗ
		|	РегистрСведений.ДокументыКОтправкеПоЭП КАК ДокументыКОтправкеПоЭП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыКоторымУжеОтправленыПисьма КАК ВТ_КонтрагентыКоторымУжеОтправленыПисьма
		|		ПО ДокументыКОтправкеПоЭП.Объект = ВТ_КонтрагентыКоторымУжеОтправленыПисьма.Контрагент
		|ГДЕ
		|	ДокументыКОтправкеПоЭП.Объект ССЫЛКА Справочник.Контрагенты
		|	И ДокументыКОтправкеПоЭП.ВидВложения = ЗНАЧЕНИЕ(Перечисление.ВидВложения.Долги)
		|	И ДокументыКОтправкеПоЭП.ПопытокЗагрузки = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контрагенты.Контрагенты КАК Контрагент,
		|	ВТ_Контрагенты.ЭлАдрес
		|ИЗ
		|	ВТ_Контрагенты КАК ВТ_Контрагенты
		|ГДЕ
		|	НЕ ВТ_Контрагенты.Контрагенты = ЗНАЧЕНИЕ(справочник.Контрагенты.ПустаяСсылка)
		|	И НЕ ВТ_Контрагенты.ЭлАдрес = """"
		|	И ВТ_Контрагенты.КонтрагентОтправлен ЕСТЬ NULL";
		
		ЗапросКонтрагентов.УстановитьПараметр("Период1", НачалоДня(ТекущаяДата()));
		ЗапросКонтрагентов.УстановитьПараметр("Период2", КонецДня(ТекущаяДата()));
		
		РезультатЗапросаКонтрагентов = ЗапросКонтрагентов.Выполнить();
		
		Если НЕ РезультатЗапросаКонтрагентов.Пустой() Тогда
			
			ВыборкаКонтрагентов = РезультатЗапросаКонтрагентов.Выбрать();
			
			Пока ВыборкаКонтрагентов.Следующий() Цикл
				
				ТабличныйДокументДолга = СформироватьТабличныйДокументСДолгамиКонтрагентаБиллинг(ВыборкаКонтрагентов.Контрагент, НазваниеОрганизации);
				
				Если ТабличныйДокументДолга   <>  Неопределено Тогда 
					
					Сообщение = Новый ИнтернетПочтовоеСообщение;
					Сообщение.Тема = "Реестр предстоящих и ПРОСРОЧЕННЫХ платежей фирме ООО ""Москворечье Трейдинг""!!";
					
					Если ВидОперации = 0 Тогда 
						ЭлПочтаКонтрагента = ВыборкаКонтрагентов.ЭлАдрес ;
					Иначе 
						ЭлПочтаКонтрагента  = Адрес;				
					КонецЕсли;
					
					МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ЭлПочтаКонтрагента, ";");
					
					Для Каждого ТекАдрес Из МассивАдресов Цикл
						Сообщение.Получатели.Добавить(ТекАдрес); 
					КонецЦикла;
					
					Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
					
					ЗаголовокФайла = Строка(Новый УникальныйИдентификатор) + ".xlsx";
					ТабличныйДокументДолга.Записать(КаталогВременныхФайлов() + ЗаголовокФайла, ТипФайлаТабличногоДокумента.XLSX);
					ДвоичныеДанныеФайла = Новый ДвоичныеДанные(КаталогВременныхФайлов() + ЗаголовокФайла);
					
					Сообщение.Вложения.Добавить(ДвоичныеДанныеФайла, "Просроченные_И_Предстоящие платежи.XLSX");
					
					Попытка
						УдалитьФайлы(КаталогВременныхФайлов() + ЗаголовокФайла);
					Исключение
					КонецПопытки;
					
					Попытка
						
						Почта.Послать(Сообщение);
						ТекстСообщения = "Отправлено письмо " + ВыборкаКонтрагентов.Контрагент + " на адрес " + ЭлПочтаКонтрагента 
						            + " с уведомлением о предстоящих и просроченных платежах";
						ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
						
						Попытка
							
							НаборЗаписей = РегистрыСведений.ПисьмоОДолгах.СоздатьНаборЗаписей(); 
							НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ВыборкаКонтрагентов.Контрагент.ОсновнойДоговорКонтрагента); 
							НаборЗаписей.Отбор.Период.Установить(ТекущаяДата()); 
							
							НовЗапись = НаборЗаписей.Добавить(); 
							НовЗапись.ДоговорКонтрагента = ВыборкаКонтрагентов.Контрагент.ОсновнойДоговорКонтрагента; 
							НовЗапись.Период = ТекущаяДата(); 
							НовЗапись.ВремяОтправки = Формат(ТекущаяДата(), "ДЛФ=T");
							НовЗапись.Количество = 1; 
							
							НаборЗаписей.Записать(Истина); 	
							
						Исключение
							
							Если НеОчищать = Ложь Тогда 
								
								Попытка	
									
									НаборЗаписей = РегистрыСведений.ДокументыКОтправкеПоЭП.СоздатьНаборЗаписей(); 
									НаборЗаписей.Отбор.Объект.Установить(ВыборкаКонтрагентов.Контрагент);
									НаборЗаписей.Отбор.ВидВложения.Установить(Перечисления.ВидВложения.Долги);
									НаборЗаписей.Записать(); 
									
								Исключение
									Сообщить(ОписаниеОшибки());
								КонецПопытки;
								
							КонецЕсли;
							
						КонецПопытки;
						
					Исключение
						
						Если НеОчищать = Ложь Тогда 
							
							Попытка	
								
								НаборЗаписей = РегистрыСведений.ДокументыКОтправкеПоЭП.СоздатьНаборЗаписей(); 
								НаборЗаписей.Отбор.Объект.Установить(ВыборкаКонтрагентов.Контрагент);
								НаборЗаписей.Отбор.ВидВложения.Установить(Перечисления.ВидВложения.Долги);
								НаборЗаписей.Записать(); 
								
							Исключение
								Сообщить(ОписаниеОшибки());
							КонецПопытки;
							
						КонецЕсли;
						
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		// Расчет долгов для контрагентов и отправка письма с напоминанием, что предстоят оплаты
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПисьмоОДолгах.ДоговорКонтрагента.Владелец КАК Контрагент
		|ПОМЕСТИТЬ ВТ_КонтрагентыКоторымУжеОтправленыПисьма
		|ИЗ
		|	РегистрСведений.ПисьмоОДолгах КАК ПисьмоОДолгах
		|ГДЕ
		|	ПисьмоОДолгах.Количество > 0
		|	И ПисьмоОДолгах.Период МЕЖДУ &Период1 И &Период2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДокументыКОтправкеПоЭП.Объект КАК Справочник.Контрагенты) КАК Контрагенты,
		|	ДокументыКОтправкеПоЭП.ЭлАдрес КАК ЭлАдрес
		|ПОМЕСТИТЬ ВТ_Контрагенты
		|ИЗ
		|	РегистрСведений.ДокументыКОтправкеПоЭП КАК ДокументыКОтправкеПоЭП
		|ГДЕ
		|	ДокументыКОтправкеПоЭП.Объект ССЫЛКА Справочник.Контрагенты
		|	И ДокументыКОтправкеПоЭП.ВидВложения = &ВидВложения
		|	И ДокументыКОтправкеПоЭП.ПопытокЗагрузки = 0
		|	И НЕ ДокументыКОтправкеПоЭП.Объект В
		|				(ВЫБРАТЬ
		|					ВТ_КонтрагентыКоторымУжеОтправленыПисьма.Контрагент
		|				ИЗ
		|					ВТ_КонтрагентыКоторымУжеОтправленыПисьма КАК ВТ_КонтрагентыКоторымУжеОтправленыПисьма)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ПОМЕСТИТЬ Договора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец В
		|			(ВЫБРАТЬ
		|				ВТ_Контрагенты.Контрагенты
		|			ИЗ
		|				ВТ_Контрагенты КАК ВТ_Контрагенты)
		|	И ДоговорыКонтрагентов.ДопустимоеЧислоДнейЗадолженности > 0
		|	И ДоговорыКонтрагентов.ВестиПоДокументамРасчетовСКонтрагентом
		|	И ДоговорыКонтрагентов.КонтролироватьЧислоДнейЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК ДопустимоеЧислоДнейЗадолженности
		|ПОМЕСТИТЬ ДолгиПоДокументам
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
		|			,
		|			ДоговорКонтрагента В
		|					(ВЫБРАТЬ
		|						Т.Ссылка
		|					ИЗ
		|						Договора КАК Т)
		|				И ДокументРасчетовСКонтрагентом ССЫЛКА Документ.РеализацияТоваровУслуг) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Таб.ДокументРасчетов) КАК КоличествоДней,
		|	Таб.ДокументРасчетов1 КАК ДокументРасчетов
		|ПОМЕСТИТЬ ТабДнейПроскочкиПоДокументу
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДолгиПоДокументам.ДокументРасчетовСКонтрагентом КАК ДокументРасчетов,
		|		ДолгиПоДокументам.ДокументРасчетовСКонтрагентом КАК ДокументРасчетов1,
		|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
		|	ИЗ
		|		ДолгиПоДокументам КАК ДолгиПоДокументам,
		|		РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|	ГДЕ
		|		ДолгиПоДокументам.ДокументРасчетовСКонтрагентом.Дата <= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
		|		И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &ТекущаяДата
		|		И (РегламентированныйПроизводственныйКалендарь.ВидДня = &РабочийДень
		|				ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = &ПредпраздничныйДень)) КАК Таб
		|
		|СГРУППИРОВАТЬ ПО
		|	Таб.ДокументРасчетов1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДолгиПоДокументам.СуммаВзаиморасчетовОстаток,
		|	ДолгиПоДокументам.Контрагент,
		|	ДолгиПоДокументам.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
		|	ДолгиПоДокументам.ДопустимоеЧислоДнейЗадолженности,
		|	ЕСТЬNULL(ТабДнейПроскочкиПоДокументу.КоличествоДней, 0) КАК Задолженность
		|ИЗ
		|	ДолгиПоДокументам КАК ДолгиПоДокументам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабДнейПроскочкиПоДокументу КАК ТабДнейПроскочкиПоДокументу
		|		ПО ДолгиПоДокументам.ДокументРасчетовСКонтрагентом = ТабДнейПроскочкиПоДокументу.ДокументРасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контрагенты.Контрагенты КАК Контрагент,
		|	ВТ_Контрагенты.ЭлАдрес
		|ИЗ
		|	ВТ_Контрагенты КАК ВТ_Контрагенты";
		
		
		Запрос.УстановитьПараметр("РабочийДень", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
		Запрос.УстановитьПараметр("ПредпраздничныйДень", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("ВидВложения", Перечисления.ВидВложения.Долги);
		
		СписокВидовВложения  = Новый Массив;
		СписокВидовВложения.Добавить(Перечисления.ВидВложения.Счет);
		СписокВидовВложения.Добавить(Перечисления.ВидВложения.ТОРГ12);
		СписокВидовВложения.Добавить(Перечисления.ВидВложения.УПД);	
		
		Запрос.УстановитьПараметр("СписокВидовВложения", СписокВидовВложения);
		Запрос.УстановитьПараметр("Период1", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("Период2", КонецДня(ТекущаяДата()));
		
		Пакет = Запрос.ВыполнитьПакет();
		ТаблицаКонтрагентовДляПисьма = Пакет[6].Выгрузить(); 	
		Результат = Пакет[5].Выгрузить();  
		
		Для Каждого ТекСтр Из ТаблицаКонтрагентовДляПисьма Цикл
			
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Тема = "Реестр предстоящих и ПРОСРОЧЕННЫХ платежей фирме ООО ""Москворечье Трейдинг""!!";
			
			Если ВидОперации = 0 Тогда 
				МылоКонтрагента = ТекСтр.ЭлАдрес;
			Иначе 
				МылоКонтрагента = Адрес;				
			КонецЕсли;
			
			МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(МылоКонтрагента, ";");
			
			Для Каждого ТекАдрес Из МассивАдресов Цикл
				Сообщение.Получатели.Добавить(ТекАдрес); 
			КонецЦикла;
			
			Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			ТабличныйДокументДолга = СформироватьТабличныйДокументСДолгамиКонтрагента(ТекСтр.Контрагент, Результат, НазваниеОрганизации);
			
			Если ТабличныйДокументДолга <> Неопределено Тогда 
				
				ЗаголовокФайла = Строка(Новый УникальныйИдентификатор) + ".xlsx";
				ТабличныйДокументДолга.Записать(КаталогВременныхФайлов() + ЗаголовокФайла, ТипФайлаТабличногоДокумента.XLSX);
				
				ДД = Новый ДвоичныеДанные(КаталогВременныхФайлов() + ЗаголовокФайла);
				Сообщение.Вложения.Добавить(ДД, "Просроченные_И_Предстоящие платежи.XLSX");
				
				Попытка
					УдалитьФайлы(КаталогВременныхФайлов() + ЗаголовокФайла);
				Исключение
				КонецПопытки;
				
				Попытка
					
					Почта.Послать(Сообщение);
					ТекстСообщения = "Отправлено письмо " + ТекСтр.Контрагент + " на адрес " + МылоКонтрагента + " с уведомлением о предстоящих и просроченных платежах";
					ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
					
					Попытка
						
						НаборЗаписей = РегистрыСведений.ПисьмоОДолгах.СоздатьНаборЗаписей(); 
						
						НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ТекСтр.Контрагент.ОсновнойДоговорКонтрагента); 
						НаборЗаписей.Отбор.Период.Установить(ТекущаяДата()); 
						
						НовЗапись = НаборЗаписей.Добавить(); 
						НовЗапись.ДоговорКонтрагента = ТекСтр.Контрагент.ОсновнойДоговорКонтрагента; 
						НовЗапись.Период = ТекущаяДата();
						НовЗапись.ВремяОтправки = Формат(ТекущаяДата(), "ДЛФ=T");
						НовЗапись.Количество = 1; 
						
						НаборЗаписей.Записать(Истина); 	
						
					Исключение
						
						Если НеОчищать = Ложь Тогда 
							
							Попытка	
								
								НаборЗаписей = РегистрыСведений.ДокументыКОтправкеПоЭП.СоздатьНаборЗаписей(); 
								НаборЗаписей.Отбор.Объект.Установить(ТекСтр.Контрагент);
								НаборЗаписей.Отбор.ВидВложения.Установить(Перечисления.ВидВложения.Долги);
								НаборЗаписей.Записать(); 
								
							Исключение
								Сообщить(ОписаниеОшибки());
							КонецПопытки;
							
						КонецЕсли;
						
					КонецПопытки;
					
				Исключение
					
					Если НеОчищать = Ложь Тогда 
						
						Попытка	
							
							НаборЗаписей = РегистрыСведений.ДокументыКОтправкеПоЭП.СоздатьНаборЗаписей(); 
							НаборЗаписей.Отбор.Объект.Установить(ТекСтр.Контрагент);
							НаборЗаписей.Отбор.ВидВложения.Установить(Перечисления.ВидВложения.Долги);
							НаборЗаписей.Записать(); 
							
						Исключение
							Сообщить(ОписаниеОшибки());
						КонецПопытки;
						
					КонецЕсли;
					
				КонецПопытки;
				
			Иначе 
				
				Если НеОчищать = Ложь Тогда 
					
					Попытка	
						
						НаборЗаписей = РегистрыСведений.ДокументыКОтправкеПоЭП.СоздатьНаборЗаписей(); 
						НаборЗаписей.Отбор.Объект.Установить(ТекСтр.Контрагент);
						НаборЗаписей.Отбор.ВидВложения.Установить(Перечисления.ВидВложения.Долги);
						НаборЗаписей.Записать(); 
						
					Исключение
						Сообщить(ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Почта.Отключиться();
	
	Если НеОчищать = Ложь Тогда 
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10000
		|	ДокументыКОтправкеПоЭП.Объект,
		|	ДокументыКОтправкеПоЭП.ВидВложения
		|ИЗ
		|	РегистрСведений.ДокументыКОтправкеПоЭП КАК ДокументыКОтправкеПоЭП
		|ГДЕ
		|	ДокументыКОтправкеПоЭП.ВидВложения = ЗНАЧЕНИЕ(Перечисление.ВидВложения.Долги)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			МенеджерЗаписи = РегистрыСведений.ДокументыКОтправкеПоЭП.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Выборка.Объект;
			МенеджерЗаписи.ВидВложения = Выборка.ВидВложения;
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;	
			
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТабличныйДокументСДолгамиКонтрагента(Контрагент,Результат,НазваниеОрганизации)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет  = ПолучитьМакет("ПисьмоОДолгах");
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаШапка.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	СуммаПросрочено = 0;
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Контрагент", Контрагент);
	Строки =  Результат.НайтиСтроки(СтруктураОтбора);
	
	Если Строки.Количество() > 0 Тогда
		
		ТабДок.Вывести(ОбластьМакетаШапка);
		ЕстьХотьОдинДокументДолга = Ложь;
		
		Для каждого СчетчикСтрок Из Строки Цикл
			
			ДнейЗадолженности = ?(ЗначениеЗаполнено(СчетчикСтрок.ДопустимоеЧислоДнейЗадолженности), СчетчикСтрок.ДопустимоеЧислоДнейЗадолженности - 1, 0); 
			
			ДатаОплаты = ЗаполнениеДокументов.ОпределитьДату(СчетчикСтрок.ДокументРасчетовСКонтрагентом.Дата, ДнейЗадолженности);
			
			Если ДатаОплаты =Неопределено  Тогда 
				//  Возможно, не заполнен Произв. календарь на будущий год
				Возврат Неопределено;
			КонецЕсли;
			
			Если НачалоДня(ДатаОплаты) < НачалоДня(ТекущаяДата()) Тогда
				
				ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка1");
				СуммаПросрочено =  СуммаПросрочено + СчетчикСтрок.СуммаВзаиморасчетовОстаток;
				
			Иначе 
				ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
			
			ОбластьМакетаСтрока.Параметры.ДокументРасчетов = СчетчикСтрок.ДокументРасчетовСКонтрагентом;
			ОбластьМакетаСтрока.Параметры.СуммаДолга  =   СчетчикСтрок.СуммаВзаиморасчетовОстаток;
			ОбластьМакетаСтрока.Параметры.ДатаОплаты  =  Формат(ДатаОплаты, "ДЛФ=D");
			ТабДок.Вывести(ОбластьМакетаСтрока);
			
			ЕстьХотьОдинДокументДолга = Истина;
			
		КонецЦикла; 
		
		Если СуммаПросрочено > 0 Тогда 
			
			ОбластьМакетаИтог = Макет.ПолучитьОбласть("Итог");
			ОбластьМакетаИтог.Параметры.СуммаПросрочено = СуммаПросрочено;
			ТабДок.Вывести(ОбластьМакетаИтог);
			
		КонецЕсли;
		
		Если ЕстьХотьОдинДокументДолга Тогда 
			Возврат ТабДок;
		Иначе 
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе 
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьНеоплаченныеДокументы_V2(МассивДоговоров, ЗаписыватьВЖурнал = Истина) Экспорт 
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;              
	
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("agreements", МассивДоговоров);
	СтруктураЗапроса.Вставить("date_from" , СокрЛП(Формат(ДобавитьМесяц(ТекущаяДата(), -2), "ДЛФ=D")));
	СтруктураЗапроса.Вставить("date_to"   , Формат(ТекущаяДата(), "ДЛФ=D"));
	
	СтрокаЗапроса = "/api/v2/client/debt-documents";
	ПредставлениеЗапроса = "Получение неоплаченных документов";
	
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = AMQP_РаботаСДокументами.ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, "POST",,,, Чеки.ВернутьJSON(СтруктураЗапроса));
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли; 
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			AMQP_РаботаСДокументами.ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли;  
		
	КонецЦикла; 		
	
	Если СтруктураРезультата.Данные <> Неопределено И ТипЗнч(СтруктураРезультата.Данные) = Тип("Массив") Тогда
		
		НеоплаченныеДокументы = Новый ТаблицаЗначений;
		НеоплаченныеДокументы.Колонки.Добавить("Контрагент");
		НеоплаченныеДокументы.Колонки.Добавить("ДоговорКонтрагента");
		НеоплаченныеДокументы.Колонки.Добавить("Документ");
		НеоплаченныеДокументы.Колонки.Добавить("ДатаДокумента");
		НеоплаченныеДокументы.Колонки.Добавить("ДатаОплаты");
		НеоплаченныеДокументы.Колонки.Добавить("Сумма");
		НеоплаченныеДокументы.Колонки.Добавить("ПросроченоДней");
		НеоплаченныеДокументы.Колонки.Добавить("Грузополучатель");
		НеоплаченныеДокументы.Колонки.Добавить("ДопустимоеЧислоДнейЗадолженности");
		НеоплаченныеДокументы.Колонки.Добавить("ДопустимаяСуммаЗадолженности");
		
		ИмяБазы = Константы.AMQP_ИдентификаторИнформацСистемы.Получить();
		
		БылиОшибки = Ложь;
		ТекстОшибок = "";
		
		Для Каждого Долг ИЗ СтруктураРезультата.Данные Цикл
			
			Попытка
				
				Дата = XmlЗначение(Тип("Дата"), Долг.date);
				
				НоваяСтрока = НеоплаченныеДокументы.Добавить();
				НоваяСтрока.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", Долг.kontragent_mdm_id);
				НоваяСтрока.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", Долг.agreement_mdm_id);
				
				ИмяБазыБиллинг = Долг.app_id;
				ТипДокумента = "";
				ТипДокументаПредставление = "";
				
				Если НРег(Долг.Type_Code) = "realization" Тогда
					
					ТипДокумента = "РеализацияТоваровУслуг";
					ТипДокументаПредставление = Метаданные.Документы[ТипДокумента].Синоним;
					
				КонецЕсли;
				
				Если НРег(ИмяБазыБиллинг) = НРег(Строка(ИмяБазы)) ИЛИ НРег(ИмяБазыБиллинг) = НРег(Строка(Константы.База.Получить())) Тогда
					
					Если ТипДокумента <> "" Тогда
						
						НоваяСтрока.Документ = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Долг.source_id));
						ОбъектДокумент = НоваяСтрока.Документ.ПолучитьОбъект();
						
						Если ОбъектДокумент = Неопределено Тогда
							НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.number + " от " + Формат(Дата, "ДЛФ=DT") + " - документ не найден";	
						Иначе
							НоваяСтрока.Грузополучатель = НоваяСтрока.Документ.Грузополучатель;
						КонецЕсли; 
						
					КонецЕсли; 
					
				Иначе
					НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.number + " от " + Формат(Дата, "ДЛФ=DT") + " - " + ИмяБазыБиллинг;
				КонецЕсли;
				
				НоваяСтрока.ДатаДокумента  = Дата;
				НоваяСтрока.Сумма          = -Число(Долг.amount);
				НоваяСтрока.ПросроченоДней = Долг.overdue_days;  
				НоваяСтрока.ДатаОплаты     = XmlЗначение(Тип("Дата"), Долг.pay_delay_date);
				
			Исключение
				
				БылиОшибки = Истина;
				ТекстОшибок = ТекстОшибок + Символы.ПС + ОписаниеОшибки();
				
			КонецПопытки; 
			
		КонецЦикла;	
		
		Если БылиОшибки И ЗаписыватьВЖурнал Тогда
			ЗаписьЖурналаРегистрации("РаботаСБиллингом.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Ошибка выполнения запроса: " + ПредставлениеЗапроса + Символы.ПС + "Текст ошибки: " + ТекстОшибок + Символы.ПС + "Текст запроса: " + СтрокаЗапроса);
		КонецЕсли;
		
		СтруктураРезультата.Данные = НеоплаченныеДокументы;	
		
	КонецЕсли;     
	
	Возврат СтруктураРезультата; 
	
КонецФункции

Функция СформироватьТабличныйДокументСДолгамиКонтрагентаБиллинг(Контрагент, НазваниеОрганизации)
	
	ТабДок = Неопределено;
	
	ЗапросДоговоровКонтрагента.УстановитьПараметр("Владелец", Контрагент);
	
	РезультатЗапросаДоговоров = ЗапросДоговоровКонтрагента.Выполнить().Выгрузить();
	
	Если НЕ РезультатЗапросаДоговоров.Количество() = 0  Тогда
		
		МассивДоговоров = РезультатЗапросаДоговоров.ВыгрузитьКолонку("КодМДМ"); 
		
		СтруктураРезультатаДанныеКонтрагента = AMQP_РаботаСДокументами.ПолучитьДанныеПоМассивуДоговоров_V2(МассивДоговоров); 		
		
		Если СтруктураРезультатаДанныеКонтрагента.Результат = 0 Тогда                                                     		
			
			ДанныеМассив = СтруктураРезультатаДанныеКонтрагента.Данные;
			
			Если НЕ ДанныеМассив = Неопределено Тогда
				
				ТаблицаДанныхДолговБиллинг = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ДанныеМассив);
				
				СтруктураРезультатаНеоплаченныеДокументы = ПолучитьНеоплаченныеДокументы_V2(МассивДоговоров);
				ДанныеМассивНеоплаченныеДокументы = СтруктураРезультатаНеоплаченныеДокументы.Данные; 
				
				Если НЕ ДанныеМассивНеоплаченныеДокументы.Количество() = 0 Тогда
					
					СуммаПросрочено = 0;
					
					ТабДок = Новый ТабличныйДокумент;
					Макет= ПолучитьМакет("ПисьмоОДолгах");
					
					ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
					ОбластьМакетаШапка.Параметры.НазваниеОрганизации = НазваниеОрганизации;
					ТабДок.Вывести(ОбластьМакетаШапка);
					
					Для Каждого СтрокаНеоплаченныхДокументов Из ДанныеМассивНеоплаченныеДокументы Цикл
						
						Если СтрокаНеоплаченныхДокументов.ПросроченоДней > 0 Тогда							
							
							ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка1");
							СуммаПросрочено = СуммаПросрочено + СтрокаНеоплаченныхДокументов.Сумма; 
							
						Иначе 
							ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
						КонецЕсли;
						
						ОбластьМакетаСтрока.Параметры.ДокументРасчетов = СтрокаНеоплаченныхДокументов.Документ;
						ОбластьМакетаСтрока.Параметры.СуммаДолга  =   СтрокаНеоплаченныхДокументов.Сумма;
						ОбластьМакетаСтрока.Параметры.ДатаОплаты  =  Формат(СтрокаНеоплаченныхДокументов.ДатаОплаты, "ДЛФ=D");
						ТабДок.Вывести(ОбластьМакетаСтрока);
						
						
					КонецЦикла;
					
					Если СуммаПросрочено > 0 Тогда 
						
						ОбластьМакетаИтог = Макет.ПолучитьОбласть("Итог");
						ОбластьМакетаИтог.Параметры.СуммаПросрочено = СуммаПросрочено;
						ТабДок.Вывести(ОбластьМакетаИтог);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТабДок;

КонецФункции 

ЗапросДоговоровКонтрагента = Новый Запрос;
ЗапросДоговоровКонтрагента.Текст =
"ВЫБРАТЬ
|	ДоговорыКонтрагентов.КодМДМ
|ИЗ
|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
|ГДЕ
|	ДоговорыКонтрагентов.Владелец = &Владелец";
